## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/10046635888)



<pre><code>Plan: 36 to add, 11 to change, 0 to destroy.</code></pre>

* Create
  * google_service_account.control-plane
  * google_service_account.counduit-cli-bucket
  * google_service_account.firebase-adminsdk-udzxq
  * google_service_account.gcr-cleaner
  * google_service_account.gcs-bucket-mover
  * google_service_account.gencred-refresher
  * google_service_account.github-issue-creator
  * google_service_account.github-issue-finder
  * google_service_account.github-webhook-gateway
  * google_service_account.gitleaks-secret-accesor
  * google_service_account.kyma-oci-image-builder
  * google_service_account.sa-dev-kyma-project
  * google_service_account.sa-gardener-logs
  * google_service_account.sa-gcr-kyma-project-trusted
  * google_service_account.sa-gcs-plank
  * google_service_account.sa-gke-kyma-integration
  * google_service_account.sa-keys-cleaner
  * google_service_account.sa-keys-rotator
  * google_service_account.sa-kyma-artifacts
  * google_service_account.sa-kyma-dns-serviceuser
  * google_service_account.sa-kyma-project
  * google_service_account.sa-prow-deploy
  * google_service_account.sa-prow-job-resource-cleaners
  * google_service_account.sa-prow-pubsub
  * google_service_account.sa-prowjob-gcp-logging-client
  * google_service_account.sa-secret-update
  * google_service_account.sa-security-dashboard-oauth
  * google_service_account.sa-vm-kyma-integration
  * google_service_account.secret-manager-prow
  * google_service_account.secret-manager-trusted
  * google_service_account.secret-manager-untrusted
  * google_service_account.secrets-leak-detector
  * google_service_account.secrets-leak-log-scanner
  * google_service_account.slack-message-sender
  * google_service_account.terraform-executor
  * google_service_account.terraform-planner
* Update
  * kubectl_manifest.automated_approver["/apis/apps/v1/namespaces/default/deployments/automated-approver"]
  * module.cors_proxy.google_cloud_run_service.cors_proxy
  * module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway
  * module.secrets_leaks_log_scanner.google_cloud_run_service.gcs_bucket_mover
  * module.secrets_leaks_log_scanner.google_cloud_run_service.github_issue_creator
  * module.secrets_leaks_log_scanner.google_cloud_run_service.github_issue_finder
  * module.secrets_leaks_log_scanner.google_cloud_run_service.secrets_leak_log_scanner
  * module.security_dashboard_token.google_cloud_run_service.security_dashboard_token
  * module.service_account_keys_cleaner.google_cloud_run_service.service_account_keys_cleaner
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner
  * module.service_account_keys_rotator.google_cloud_run_service.service_account_keys_rotator



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_service_account.control-plane will be created
  + resource "google_service_account" "control-plane" {
      + account_id   = "control-plane"
      + description  = "Main prow components SA Will be removed with Prow"
      + disabled     = false
      + display_name = "control-plane"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.counduit-cli-bucket will be created
  + resource "google_service_account" "counduit-cli-bucket" {
      + account_id   = "counduit-cli-bucket"
      + description  = "SA to push/pull conduit-cli"
      + disabled     = false
      + display_name = "counduit-cli-bucket"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.firebase-adminsdk-udzxq will be created
  + resource "google_service_account" "firebase-adminsdk-udzxq" {
      + account_id   = "firebase-adminsdk-udzxq"
      + description  = "Firebase Admin SDK Service Agent"
      + disabled     = false
      + display_name = "firebase-adminsdk"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.gcr-cleaner will be created
  + resource "google_service_account" "gcr-cleaner" {
      + account_id   = "gcr-cleaner"
      + description  = "Service account is used by gcr-cleaner tool."
      + disabled     = false
      + display_name = "gcr-cleaner"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.gcs-bucket-mover will be created
  + resource "google_service_account" "gcs-bucket-mover" {
      + account_id   = "gcs-bucket-mover"
      + description  = "Identity of cloud run instance running gcs bucket mover service."
      + disabled     = false
      + display_name = "gcs-bucket-mover"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.gencred-refresher will be created
  + resource "google_service_account" "gencred-refresher" {
      + account_id   = "gencred-refresher"
      + description  = "Service Account used to automatically refresh kubeconfigs for workload cluster on Prow using ProwJob `ci-gencred-refresh-kubeconfig` Will be removed with Prow"
      + disabled     = false
      + display_name = "gencred-refresher"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.github-issue-creator will be created
  + resource "google_service_account" "github-issue-creator" {
      + account_id   = "github-issue-creator"
      + description  = "Identity of cloud run instance running github issue creator service."
      + disabled     = false
      + display_name = "github-issue-creator"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.github-issue-finder will be created
  + resource "google_service_account" "github-issue-finder" {
      + account_id   = "github-issue-finder"
      + description  = "Identity of cloud run instance running github issue finder service."
      + disabled     = false
      + display_name = "github-issue-finder"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.github-webhook-gateway will be created
  + resource "google_service_account" "github-webhook-gateway" {
      + account_id   = "github-webhook-gateway"
      + description  = "Identity of cloud run instance running github webhook gateway service."
      + disabled     = false
      + display_name = "github-webhook-gateway"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.gitleaks-secret-accesor will be created
  + resource "google_service_account" "gitleaks-secret-accesor" {
      + account_id   = "gitleaks-secret-accesor"
      + description  = "Identity of gitleaks. It's used to retrieve secrets from secret manager"
      + disabled     = false
      + display_name = "gitleaks-secret-accesor"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.kyma-oci-image-builder will be created
  + resource "google_service_account" "kyma-oci-image-builder" {
      + account_id   = "kyma-oci-image-builder"
      + description  = "Service Account for retrieving secrets on the oci-image-builder ADO pipeline."
      + disabled     = false
      + display_name = "kyma-oci-image-builder"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-dev-kyma-project will be created
  + resource "google_service_account" "sa-dev-kyma-project" {
      + account_id   = "sa-dev-kyma-project"
      + description  = "SA to manage DEV Artifact Registry in SAP CX Kyma Project"
      + disabled     = false
      + display_name = "sa-dev-kyma-project"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-gardener-logs will be created
  + resource "google_service_account" "sa-gardener-logs" {
      + account_id   = "sa-gardener-logs"
      + description  = "SA used by gardener cluster to send logs to Stackdriver. Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-gardener-logs"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-gcr-kyma-project-trusted will be created
  + resource "google_service_account" "sa-gcr-kyma-project-trusted" {
      + account_id   = "sa-gcr-kyma-project-trusted"
      + description  = "Access to GCR in kyma-project and KMS key in kyma-prow. Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-gcr-kyma-project-trusted"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-gcs-plank will be created
  + resource "google_service_account" "sa-gcs-plank" {
      + account_id   = "sa-gcs-plank"
      + description  = "The `plank` component schedules the pod requested by a prowjob. Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-gcs-plank"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-gke-kyma-integration will be created
  + resource "google_service_account" "sa-gke-kyma-integration" {
      + account_id   = "sa-gke-kyma-integration"
      + description  = "Service account is used by Prow to integrate with GKE."
      + disabled     = false
      + display_name = "sa-gke-kyma-integration"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-keys-cleaner will be created
  + resource "google_service_account" "sa-keys-cleaner" {
      + account_id   = "sa-keys-cleaner"
      + description  = "Identity of the service account keys rotator service."
      + disabled     = false
      + display_name = "sa-keys-cleaner"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-keys-rotator will be created
  + resource "google_service_account" "sa-keys-rotator" {
      + account_id   = "sa-keys-rotator"
      + description  = "Identity of the service account keys rotator service."
      + disabled     = false
      + display_name = "sa-keys-rotator"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-kyma-artifacts will be created
  + resource "google_service_account" "sa-kyma-artifacts" {
      + account_id   = "sa-kyma-artifacts"
      + description  = "Service account used by ProwJob kyma-artifacts. Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-kyma-artifacts"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-kyma-dns-serviceuser will be created
  + resource "google_service_account" "sa-kyma-dns-serviceuser" {
      + account_id   = "sa-kyma-dns-serviceuser"
      + description  = "<Used by api-gateway> Service Account used to manipulate DNS entries in sap-kyma-prow-workloads. Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-kyma-dns-serviceuser"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-kyma-project will be created
  + resource "google_service_account" "sa-kyma-project" {
      + account_id   = "sa-kyma-project"
      + description  = "SA to manage PROD Artifact Registry in SAP CX Kyma Project"
      + disabled     = false
      + display_name = "sa-kyma-project"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-prow-deploy will be created
  + resource "google_service_account" "sa-prow-deploy" {
      + account_id   = "sa-prow-deploy"
      + description  = "SA with admin rights in Prow cluster Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-prow-deploy"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-prow-job-resource-cleaners will be created
  + resource "google_service_account" "sa-prow-job-resource-cleaners" {
      + account_id   = "sa-prow-job-resource-cleaners"
      + description  = "SA used by multiple resource cleaner prowjobs. Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-prow-job-resource-cleaners"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-prow-pubsub will be created
  + resource "google_service_account" "sa-prow-pubsub" {
      + account_id   = "sa-prow-pubsub"
      + description  = "Run prow related pubsub topics, subscriptions and cloud functions. Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-prow-pubsub"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-prowjob-gcp-logging-client will be created
  + resource "google_service_account" "sa-prowjob-gcp-logging-client" {
      + account_id   = "sa-prowjob-gcp-logging-client"
      + description  = "Read, write access to google cloud logging for prowjobs. Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-prowjob-gcp-logging-client"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-secret-update will be created
  + resource "google_service_account" "sa-secret-update" {
      + account_id   = "sa-secret-update"
      + description  = "Can update secrets in Secret Manager"
      + disabled     = false
      + display_name = "sa-secret-update"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-security-dashboard-oauth will be created
  + resource "google_service_account" "sa-security-dashboard-oauth" {
      + account_id   = "sa-security-dashboard-oauth"
      + description  = "Used for the Security dashboard cloud run"
      + disabled     = false
      + display_name = "sa-security-dashboard-oauth"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa-vm-kyma-integration will be created
  + resource "google_service_account" "sa-vm-kyma-integration" {
      + account_id   = "sa-vm-kyma-integration"
      + description  = "Will be removed with Prow"
      + disabled     = false
      + display_name = "sa-vm-kyma-integration"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.secret-manager-prow will be created
  + resource "google_service_account" "secret-manager-prow" {
      + account_id   = "secret-manager-prow"
      + description  = "Will be removed with Prow"
      + disabled     = false
      + display_name = "secret-manager-prow"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.secret-manager-trusted will be created
  + resource "google_service_account" "secret-manager-trusted" {
      + account_id   = "secret-manager-trusted"
      + description  = "Will be removed with Prow"
      + disabled     = false
      + display_name = "secret-manager-trusted"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.secret-manager-untrusted will be created
  + resource "google_service_account" "secret-manager-untrusted" {
      + account_id   = "secret-manager-untrusted"
      + description  = "Will be deleted with Prow"
      + disabled     = false
      + display_name = "secret-manager-untrusted"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.secrets-leak-detector will be created
  + resource "google_service_account" "secrets-leak-detector" {
      + account_id   = "secrets-leak-detector"
      + description  = "Identity of secrets leak detector application."
      + disabled     = false
      + display_name = "secrets-leak-detector"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.secrets-leak-log-scanner will be created
  + resource "google_service_account" "secrets-leak-log-scanner" {
      + account_id   = "secrets-leak-log-scanner"
      + description  = "Identity of cloud run instance running log scanner service."
      + disabled     = false
      + display_name = "secrets-leak-log-scanner"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.slack-message-sender will be created
  + resource "google_service_account" "slack-message-sender" {
      + account_id   = "slack-message-sender"
      + description  = "Identity of cloud run instance running slack message sender service."
      + disabled     = false
      + display_name = "slack-message-sender"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.terraform-executor will be created
  + resource "google_service_account" "terraform-executor" {
      + account_id   = "terraform-executor"
      + description  = "Identity of terraform executor. It's mapped to k8s service account through workload identity."
      + disabled     = false
      + display_name = "terraform-executor"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.terraform-planner will be created
  + resource "google_service_account" "terraform-planner" {
      + account_id   = "terraform-planner"
      + description  = "Identity of terraform planner"
      + disabled     = false
      + display_name = "terraform-planner"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # kubectl_manifest.automated_approver["/apis/apps/v1/namespaces/default/deployments/automated-approver"] will be updated in-place
  ~ resource "kubectl_manifest" "automated_approver" {
        id                      = "/apis/apps/v1/namespaces/default/deployments/automated-approver"
        name                    = "automated-approver"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                app: automated-approver
              name: automated-approver
              namespace: default
            spec:
              selector:
                matchLabels:
                  app: automated-approver
              template:
                metadata:
                  labels:
                    app: automated-approver
                spec:
                  containers:
                  - args:
                    - --dry-run=false
                    - --port=8080
                    - --hmac-secret-file=/etc/webhook/hmac
                    - --log-level=info
                    - --github-endpoint=http://ghproxy
                    - --github-endpoint=https://api.github.com
                    - --github-token-path=/etc/github/oauth
                    - --rules-path=/etc/config/rules.yaml
                    - --wait-for-statuses-timeout=1800
          -         image: europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/automated-approver:v20240719-fe138649
          +         image: europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/automated-approver:v20240722-26198925
                    imagePullPolicy: Always
                    name: automated-approver
                    ports:
                    - containerPort: 8080
                      name: http
                    volumeMounts:
                    - mountPath: /etc/webhook
                      name: hmac
                      readOnly: true
                    - mountPath: /etc/github
                      name: oauth
                      readOnly: true
                    - mountPath: /etc/config
                      name: rules
                      readOnly: true
                  volumes:
                  - name: hmac
                    secret:
                      secretName: hmac-token
                  - name: oauth
                    secret:
                      secretName: neighbors-dev-bot-github-token
                  - configMap:
                      items:
                      - key: rules
                        path: rules.yaml
                      name: automated-approver-rules
                    name: rules
        EOT
        # (14 unchanged attributes hidden)
    }

  # module.cors_proxy.google_cloud_run_service.cors_proxy will be updated in-place
  ~ resource "google_cloud_run_service" "cors_proxy" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/cors-proxy"
        name                       = "cors-proxy"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/cors-proxy:v20240719-49542d2d" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/cors-proxy:v20240722-26198925"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway will be updated in-place
  ~ resource "google_cloud_run_service" "github_webhook_gateway" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/github-webhook-gateway"
        name                       = "github-webhook-gateway"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/github-webhook-gateway:v20240719-fe138649" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/github-webhook-gateway:v20240722-26198925"
                    # (2 unchanged attributes hidden)

                    # (12 unchanged blocks hidden)
                }

                # (2 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service.gcs_bucket_mover will be updated in-place
  ~ resource "google_cloud_run_service" "gcs_bucket_mover" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/gcs-bucket-mover"
        name                       = "gcs-bucket-mover"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/move-gcs-bucket:v20240719-fe138649" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/move-gcs-bucket:v20240722-26198925"
                    # (2 unchanged attributes hidden)

                    # (9 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service.github_issue_creator will be updated in-place
  ~ resource "google_cloud_run_service" "github_issue_creator" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/github-issue-creator"
        name                       = "github-issue-creator"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/create-github-issue:v20240719-fe138649" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/create-github-issue:v20240722-26198925"
                    # (2 unchanged attributes hidden)

                    # (11 unchanged blocks hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service.github_issue_finder will be updated in-place
  ~ resource "google_cloud_run_service" "github_issue_finder" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/github-issue-finder"
        name                       = "github-issue-finder"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/search-github-issue:v20240719-fe138649" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/search-github-issue:v20240722-26198925"
                    # (2 unchanged attributes hidden)

                    # (11 unchanged blocks hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service.secrets_leak_log_scanner will be updated in-place
  ~ resource "google_cloud_run_service" "secrets_leak_log_scanner" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/secrets-leak-log-scanner"
        name                       = "secrets-leak-log-scanner"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/scan-logs-for-secrets:v20240719-fe138649" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/scan-logs-for-secrets:v20240722-26198925"
                    # (2 unchanged attributes hidden)

                    # (7 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.security_dashboard_token.google_cloud_run_service.security_dashboard_token will be updated in-place
  ~ resource "google_cloud_run_service" "security_dashboard_token" {
        id                         = "locations/europe-west1/namespaces/sap-kyma-prow/services/security-dashboard-token"
        name                       = "security-dashboard-token"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/dashboard-token-proxy:v20240719-fe138649" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/dashboard-token-proxy:v20240722-26198925"
                    name    = "dashboard-token-proxy-1"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.service_account_keys_cleaner.google_cloud_run_service.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_run_service" "service_account_keys_cleaner" {
        id                         = "locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-cleaner"
        name                       = "service-account-keys-cleaner"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/service-account-keys-cleaner:v20240719-49542d2d" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/service-account-keys-cleaner:v20240722-26198925"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.service_account_keys_rotator.google_cloud_run_service.service_account_keys_rotator will be updated in-place
  ~ resource "google_cloud_run_service" "service_account_keys_rotator" {
        id                         = "locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-rotator"
        name                       = "service-account-keys-rotator"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/rotate-service-account:v20240719-49542d2d" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/rotate-service-account:v20240722-26198925"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 36 to add, 11 to change, 0 to destroy.

Changes to Outputs:
  ~ service_account_keys_cleaner                        = {
      ~ service_account_keys_cleaner_cloud_run_service = {
            id                         = "locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-cleaner"
            name                       = "service-account-keys-cleaner"
          ~ template                   = [
              ~ {
                  ~ spec     = [
                      ~ {
                          ~ containers            = [
                              ~ {
                                  ~ image          = "europe-docker.pkg.dev/kyma-project/prod/test-infra/service-account-keys-cleaner:v20240719-49542d2d" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/service-account-keys-cleaner:v20240722-26198925"
                                    name           = ""
                                    # (10 unchanged attributes hidden)
                                },
                            ]
                            # (5 unchanged attributes hidden)
                        },
                    ]
                    # (1 unchanged attribute hidden)
                },
            ]
            # (7 unchanged attributes hidden)
        }
      ~ service_account_keys_cleaner_service_account   = {
          ~ display_name                 = null -> ""
            id                           = "projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com"
            name                         = "projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com"
            # (9 unchanged attributes hidden)
        }
        # (1 unchanged attribute hidden)
    }
  ~ service_account_keys_rotator                        = {
      ~ service_account_keys_rotator_cloud_run_service   = {
            id                         = "locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-rotator"
            name                       = "service-account-keys-rotator"
          ~ template                   = [
              ~ {
                  ~ spec     = [
                      ~ {
                          ~ containers            = [
                              ~ {
                                  ~ image          = "europe-docker.pkg.dev/kyma-project/prod/test-infra/rotate-service-account:v20240719-49542d2d" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/rotate-service-account:v20240722-26198925"
                                    name           = ""
                                    # (10 unchanged attributes hidden)
                                },
                            ]
                            # (5 unchanged attributes hidden)
                        },
                    ]
                    # (1 unchanged attribute hidden)
                },
            ]
            # (7 unchanged attributes hidden)
        }
      ~ service_account_keys_rotator_service_account     = {
          ~ display_name                 = null -> ""
            id                           = "projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
            name                         = "projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
            # (9 unchanged attributes hidden)
        }
      ~ service_account_keys_rotator_service_account_iam = {
          ~ etag      = "BwYdmGHk6Mk=" -> "BwYd1WBhkJc="
            id        = "sap-kyma-prow/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
            # (4 unchanged attributes hidden)
        }
        # (1 unchanged attribute hidden)
    }
  ~ terraform_executor_gcp_prow_project_iam_member      = {
      ~ etag      = "BwYdmGHk6Mk=" -> "BwYd1WBhkJc="
        id        = "sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
        # (4 unchanged attributes hidden)
    }
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # google_project_iam_member.terraform_executor_prow_project_owner has changed
  ~ resource "google_project_iam_member" "terraform_executor_prow_project_owner" {
      ~ etag    = "BwYdmGHk6Mk=" -> "BwYd1WBhkJc="
        id      = "sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator has changed
  ~ resource "google_project_iam_member" "service_account_keys_rotator" {
      ~ etag    = "BwYdmGHk6Mk=" -> "BwYd1WBhkJc="
        id      = "sap-kyma-prow/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":11405,"Program":"tfcmt","SHA1":"0007453b750d8a5e4e95da3d1daba810ea229fb8","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->